# GitHub Actions Workflow Syntax
## https://docs.github.com/en/actions/using-workflows/workflow-syntax-for-github-actions
The GitHub Actions workflow syntax documentation provides a comprehensive reference of keywords, event triggers, permissions, and concurrency controls for defining CI/CD pipelines in YAML. It addresses core implementation needs by detailing job and step definitions, matrix strategies, caching, and built-in functions for conditionals and expressions. Last known update: continuously maintained on GitHub. Authoritative as the official GitHub documentation.
## Creative Commons Attribution 4.0 International (CC BY 4.0)

# GitHub Actions Reusing Workflows
## https://docs.github.com/en/actions/using-workflows/reusing-workflows
This guide covers how to modularize and reuse workflows across repositories using the `workflow_call` event, inputs/outputs conventions, and repository dispatch mechanisms. It provides actionable examples for designing maintainable, composable workflows, essential for understanding and extending agentic-lib patterns. Last known update: 2023. Authoritative as official GitHub documentation.
## Creative Commons Attribution 4.0 International (CC BY 4.0)

# GitHub API Documentation (REST & GraphQL)
## https://docs.github.com/en/rest
The GitHub API documentation covers both REST and GraphQL endpoints for managing issues, pull requests, workflows, artifacts, and repository metadata. It provides essential technical specifications including request schemas, pagination, authentication, rate limits, and error handling. Understanding this documentation is critical for implementing automated issue triage, workflow coordination, and data fetching with minimal API calls. Last known update: 2024. Authoritative as official GitHub documentation.
## Creative Commons Attribution 4.0 International (CC BY 4.0)

# agentic-lib Reusable Workflows
## https://github.com/xn-intenton-z2a/agentic-lib
The agentic-lib repository showcases a suite of reusable GitHub Actions workflows designed for autonomous repository maintenance: creating issues, generating code, automerging changes, and reviewing issues. Reviewing its documentation and examples reveals best practices for workflow composition, error-recovery strategies, branching conventions, and direct LLM integration patterns. Last known update: per repository commits. Authoritative as source.
## Apache-2.0

# Node.js ECMAScript Modules
## https://nodejs.org/api/esm.html
The Node.js ESM documentation explains the module resolution algorithm, package exports, conditional exports, and interoperability between CommonJS and ESM. It is essential for configuring `package.json` imports, using `import.meta.url`, and ensuring predictable script execution in Node.js 20+. Last known update: Node.js v20. Authoritative as official Node.js documentation.
## MIT

# Vitest Testing Framework
## https://vitest.dev/guide/
Vitest's official guide covers setup, configuration, mocking, coverage reporting, and parallel test runs. It provides actionable examples for writing unit and integration tests, performance benchmarks, and advanced mocking patterns aligned with Vite. This is the primary resource for extending and debugging the repository's test suite. Last known update: 2024. Authoritative from project maintainers.
## MIT

# OpenAI Node.js SDK
## https://platform.openai.com/docs/libraries/node-js
The OpenAI Node.js SDK documentation details client instantiation, methods for completions, embeddings, fine-tuning, error handling, and streaming patterns. It underpins the agentic workflows by offering direct code examples, type definitions, and configuration defaults. Last known update: 2024. Authoritative as official OpenAI docs.
## MIT

# Zod Validation Library
## https://github.com/colinhacks/zod
Zod's documentation explains schema definitions, parsing, data transformations, and integration with TypeScript for runtime type safety. It addresses validation needs such as error formatting, custom refinements, union/discriminated schemas, and integration with frameworks. Last known update: 2024. Authoritative from repository sources.
## MIT

# EJS Templating Engine
## https://ejs.co/#docs
EJS's documentation covers template syntax, includes, filters, and rendering options. It provides practical insights for generating dynamic content within workflows, such as issue templates, release notes, and markdown reports. Last known update: 2023. Authoritative as official EJS site.
## MIT

# js-yaml YAML Parser
## https://github.com/nodeca/js-yaml#readme
The js-yaml README outlines API usage for parsing and dumping YAML, custom schema creation, safe loading options, and security considerations. It is crucial for reading and manipulating workflow and documentation manifests programmatically. Last known update: 2024. Authoritative from package repository.
## MIT

# markdown-it Markdown Parser
## https://github.com/markdown-it/markdown-it
The markdown-it documentation covers plugin architecture, syntax customization, and HTML rendering options. It is valuable for generating or validating markdown content such as README updates, change logs, and documentation files programmatically. Last known update: 2023. Authoritative from package repository.
## MIT

# minimatch Glob Pattern Matcher
## https://github.com/isaacs/minimatch
Minimatch's documentation explains POSIX glob matching, brace expansion, negation patterns, and options for dotfiles. It is essential for implementing file path filtering and pattern matching in scripts and workflows. Last known update: 2024. Authoritative from package repository.
## ISC

# ESLint Linting Rules and Configuration
## https://eslint.org/docs/latest/
ESLint's official documentation delineates rule definitions, configuration hierarchies, plugin usage, and autofix strategies. It provides the foundation for code quality enforcement in the repository and guides the creation of custom rule sets. Last known update: 2024. Authoritative as official ESLint documentation.
## MIT

# Prettier Code Formatter
## https://prettier.io/docs/en/index.html
Prettier's documentation presents formatting options, plugin architecture, and editor integrations. It ensures consistent code style across automated commits and pull requests and offers actionable configuration examples. Last known update: 2024. Authoritative as official Prettier documentation.
## MIT

# Function-Plot Library
## https://github.com/maurizzzio/function-plot
Function-Plot is a high-level JavaScript library for plotting mathematical functions in web browsers using SVG. Its documentation details the API for defining functions, axes, domains, styling, and data point sampling. It demonstrates conversion of user expressions into precise SVG paths and provides examples for embedding plots in static and interactive contexts. Last known update: 2023. Authoritative as project repository (MIT).
## MIT

# SVG Path Specification
## https://www.w3.org/TR/SVG/paths.html
The SVG Path specification defines the syntax and semantics of the `<path>` element’s `d` attribute, including commands (M, L, C, A, etc.), relative vs. absolute coordinates, arc definitions, and path data parsing rules. This W3C Recommendation is essential for generating accurate SVG path strings when programmatically plotting functions or custom graphics. Last updated: 2018-10-05. Authoritative as W3C Recommendation.
## W3C Document License