# GitHub Actions Workflow Authoring
## https://docs.github.com/en/actions
Consolidated guide covering workflow definition and reuse, including triggers (`push`, `pull_request`, `workflow_call`), reusable workflows, contexts & expressions for dynamic logic, job dependencies, and best practices for performance and security. Essential for composing modular CI/CD pipelines in agentic-lib: defines input/output schemas, secret propagation, permission scopes, concurrency controls, and expression syntax to make workflows adaptable and maintainable.
Last updated: 2024-06-01 (aggregated). Official GitHub documentation is authoritative based on release notes.
## Creative Commons Attribution 4.0 International (CC BY 4.0)

# GitHub Actions Workflow Data and Logging
## https://docs.github.com/en/actions/using-workflows
Includes detailed sections on caching dependencies (actions/cache), persisting artifacts (actions/upload-artifact, actions/download-artifact), and advanced workflow commands for structured logging (masking secrets, grouping logs, setting outputs, timing annotations). Provides actionable patterns to speed up runs, share data between jobs, and generate machine-readable logs for agentic orchestration.
Last updated: 2024-05-15. Official GitHub documentation.
## Creative Commons Attribution 4.0 International (CC BY 4.0)

# GitHub Actions Creating Custom Actions
## https://docs.github.com/en/actions/creating-actions
Comprehensive metadata syntax reference (`action.yml`), JavaScript and TypeScript action authoring guides, packaging recommendations, and runtime environment considerations. Vital for extending agentic-lib with custom actions: covers inputs/outputs schema, environment variables, Docker container actions, and best practices for version pinning and security.
Last updated: 2024-04-20. Official GitHub documentation.
## Creative Commons Attribution 4.0 International (CC BY 4.0)

# GitHub CLI Manual
## https://cli.github.com/manual/
Official reference for `gh` commands: issues, pull requests, workflow dispatch, labels, and authentication flows. Enables scripting repository operations outside the API, useful for local testing and debugging of agentic workflows, automating manual dispatch, and querying workflow run statuses.
Last updated: 2024. GitHub CLI documentation is maintained in open-source CLI repo.
## MIT

# GitHub REST API
## https://docs.github.com/en/rest
Unified reference to REST endpoints for issues, pulls, workflows, artifacts, and repository management. Provides request/response schemas, pagination patterns, authentication scopes, and error handling guidance. Core to agentic-lib flows for issue-to-code automation and custom recovery logic.
Last updated: 2024-04-05. Official GitHub documentation.
## Creative Commons Attribution 4.0 International (CC BY 4.0)

# GitHub GraphQL API
## https://docs.github.com/en/graphql
Authoritative schema reference for v4 GraphQL API: queries, mutations, authentication models, batching strategies, and performance considerations. Offers efficient data retrieval and reduces API call counts when orchestrating complex agentic workflows.
Last updated: 2024-05-20. Official GitHub documentation.
## Creative Commons Attribution 4.0 International (CC BY 4.0)

# GitHub API Authentication and Apps
## https://docs.github.com/en/developers/apps
Detailed guide on GitHub App and OAuth App authentication, webhook setup, permissions model, and JWT workflows. Enables secure, scoped API access for automated workflows and custom bots beyond personal access tokens.
Last updated: 2024-03-10. Official GitHub documentation.
## Creative Commons Attribution 4.0 International (CC BY 4.0)

# Node.js ESM Modules
## https://nodejs.org/api/esm.html
Official Node.js guide to ESM loader, `import`/`export` syntax, interoperability with CommonJS, file extensions, and loader hooks. Critical for ensuring predictable module resolution in `src/lib/main.js`, test suites, and action scripts under Node.js v20.
Last updated: Node.js v20 documentation (2024).
## OpenJS Foundation (MIT-compatible)

# OpenAI Chat API & Node.js SDK
## https://platform.openai.com/docs/api-reference/chat
Definitive reference for the Chat Completions endpoint: request/response schemas, streaming best practices, error handling, rate limits, and Node.js SDK usage patterns. Underlies all LLM-driven steps in agentic workflows, including prompt design, token management, and retry logic.
Last updated: 2024-05-15. Published by OpenAI.
## OpenAI API Terms of Use; MIT (Node.js SDK)

# OpenAI API Rate Limits and Usage Guidelines
## https://platform.openai.com/docs/guides/rate-limits
Practical overview of rate-limit tiers, backoff strategies, concurrency controls, and best practices to avoid throttle errors. Essential for designing resilient agentic workflows that perform high-volume LLM calls without interruption.
Last updated: 2024-02-01. Official OpenAI documentation.
## OpenAI API Terms of Use

# Zod: Type Validation for TypeScript and JavaScript
## https://github.com/colinhacks/zod
Authoritative repository covering schema definitions, refinements, nested types, custom error messages, and performance tuning. Ensures robust runtime validation of workflow inputs and LLM outputs in agentic-lib.
Last commit: 2024-03-20.
## MIT

# Agentic-lib: Reusable Agentic GitHub Workflows
## https://github.com/xn-intenton-z2a/agentic-lib
Primary reference for composable GitHub Actions workflows automating issue creation, code mutation, PR merging, and review. Includes detailed schema definitions, input parameters, branching strategies, and example pipelines.
Last commit: 2024-06-01.
## MIT

# dotenv – Environment Variable Management
## https://github.com/motdotla/dotenv#readme
Official guide to loading `.env` configurations into `process.env`, with options for encoding, path overrides, and variable precedence. Essential for securely managing secrets (e.g., `CHATGPT_API_SECRET_KEY`) in local and CI environments.
Last updated: 2024-05.
## MIT

# js-yaml – YAML Parsing for JavaScript
## https://github.com/nodeca/js-yaml#readme
Thorough documentation on parsing (`load`, `loadAll`) and serializing (`dump`) YAML in JavaScript, schema modes, safe-load options, and error handling strategies. Critical for reading/writing GitHub workflow and config files.
Last updated: 2024-04-10.
## MIT

# EJS: JavaScript Templating
## https://ejs.co/
Comprehensive documentation on EJS syntax, partials, include strategies, and performance tips. Enables templated generation of workflow files, issue bodies, and report rendering in agentic-lib pipelines.
Last updated: 2024. Official EJS documentation.
## MIT

# Markdown-it: Markdown Parsing and GitHub Flavored Markdown
## https://github.com/markdown-it/markdown-it#readme
Extensive guide on core parsing/rendering options, plugin ecosystem, and performance benchmarks. Supports converting markdown (e.g., issue descriptions, README updates) into HTML for previews. Includes GitHub Flavored Markdown plugin support.
Last updated: 2024-05. Official project documentation.
## MIT